app/controllers/builds_controller.rb

  def index
    Rails.logger.info "[BUILDS INDEX] Loading builds list for user: #{current_user&.id || 'guest'}"
    @builds = Build.order(created_at: :desc)
---
SELECT "builds".* FROM "builds" ORDER BY "builds"."created_at" DESC

  def create
    @build = Build.new(build_params)
    @build.user = current_user if current_user

    if @build.save
---
INSERT INTO "builds" ("name", "total_wattage", "user_id", "created_at", "updated_at") VALUES ('Build 1', NULL, 1, '2025-09-29 16:59:24.331710', '2025-09-29 16:59:24.331710') RETURNING "id"
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ('Harsh', 'harsh@example.com', '2025-09-29 21:55:24.854541', '2025-09-29 21:55:24.854541') RETURNING "id"

  def set_build
    @build = Build.find(params[:id])
---
SELECT "builds".* FROM "builds" WHERE "builds"."id" = 1 LIMIT 1