app/controllers/home_controller.rb

SELECT "builds".* FROM "builds" ORDER BY "builds"."created_at" DESC LIMIT 3
---
  def index
    Rails.logger.info "[HOME INDEX] Loading homepage for user: #{current_user&.id || 'guest'}"

    @categories = {
      "Cpu"        => Cpu,
      "GPU"        => Gpu,
      "Motherboard"=> Motherboard,
      "Memory"     => Memory,
      "Storage"    => Storage,
      "Cooler"     => Cooler,
      "PcCase"       => PcCase,
      "PSU"        => Psu
    }

    Rails.logger.info "[HOME INDEX] Loading sample parts from #{@categories.count} categories"

    # load a few parts from each category
    @sample_parts = {}
    total_sample_parts = 0
    @categories.each do |name, klass|
      @sample_parts[name] = klass.limit(3)
      count = @sample_parts[name].count
      total_sample_parts += count
      Rails.logger.debug "[HOME INDEX] Loaded #{count} sample #{name} parts"
    end

    Rails.logger.info "[HOME INDEX] Loaded #{total_sample_parts} total sample parts"

    @recent_builds = Build.order(created_at: :desc).limit(3)