app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts" WHERE "parts"."id" = 2 LIMIT 1
---
  def show
    Rails.logger.info "[PARTS SHOW] Loading part ID: #{params[:id]} for user: #{current_user&.id || 'guest'}"
    @part = Part.find(params[:id])